Repository: andredobbss/Ambev
Catalog: src/Ambev.Domain/Resourcers/ResourceMessagesException.*.resx
Languages: pt_br

# BOOLEAN
source: Field must be true or false
pt_br: O campo deve ser verdadeiro ou falso

# DISCOUNT
source: Discount must be between 0 and 1
pt_br: O desconto deve estar entre 0 e 1

# EMPTY_FIELD
source: Field cannot be empty
pt_br: O campo não pode ser vazio

# EMPTY_PASSWORD
source: The 'Password' field is required
pt_br: O campo 'Password' é obrigatório

# ERROR_AUTHENTICATION
source: Invalid token
pt_br: Token inválido

# ERROR_DETAIL_AUTHENTICATION
source: The token has expired or is invalid
pt_br: O token expirou ou é inválido

# ERROR_DETAIL_DOMAIN
source: The following fields have errors
pt_br: Os seguintes campos possuem erros

# ERROR_DETAIL_ID
source: The ID provided in the URL does not match the ID in the request body. ID provided:
pt_br: O ID fornecido na URL não corresponde ao ID do corpo da requisição. ID fornecido:

# ERROR_DETAIL_INTERNAL_SERVER
source: An unexpected error occurred
pt_br: Ocorreu um erro inesperado

# ERROR_DOMAIN
source: Domain validation error
pt_br: Erro de validação no domínio

# ERROR_ID
source: Invalid ID
pt_br: ID inválido

# ERROR_ID_NEW_EXCEPTION
source: Record with the given ID not found. Provided ID:
pt_br: Registro com o ID fornecido não encontrado. ID fornecido:

# ERROR_INTERNAL_SERVER
source: Internal Server Error
pt_br: Erro interno do servidor

# ERROR_LOGIN
source: Enter username and password
pt_br: Informar o usuário e senha

# ERROR_RESOURCE_NOT_FOUND
source: Resource not found
pt_br: Recurso não encontrado

# INVALID_DATE
source: Enter a valid date
pt_br: Informar uma data válida

# INVALID_DISCOUNT_RULE
source: The applied discount rule is invalid for the quantity of items in the cart
pt_br: A regra de desconto aplicada é inválida para a quantidade de itens no carrinho

# INVALID_EMAIL
source: Please provide a valid email address
pt_br: Informar um endereço de email válido

# INVALID_FILTER
source: Invalid filter type or incompatible filter value
pt_br: Tipo de filtro inválido ou valor de filtro incompatível

# INVALID_IDENTIFIED
source: Enter a valid identfier
pt_br: Informar um Identificador válido

# INVALID_LOGIN
source: Authentication not validated
pt_br: A autenticação não foi validada

# INVALID_NUMBER
source: Please provide a valid number
pt_br: Forneça um número válido

# LENGTH_ 100
source: Maximum number of characters is 100
pt_br: Número máximo de caracteres é de 100

# LENGTH_ 15
source: Maximum number of characters is 15
pt_br: Número máximo de caracteres é de 15

# LENGTH_ 20
source: Maximum number of characters is 20
pt_br: Número máximo de caracteres é de 20

# LENGTH_ 255
source: Maximum number of characters is 255
pt_br: Número máximo de caracteres é de 255

# LENGTH_ 50
source: Maximum number of characters is 50
pt_br: Número máximo de caracteres é de 50

# LENGTH_ 500
source: Maximum number of characters is 500
pt_br: Número máximo de caracteres é de 500

# NULL_FIELD
source: Field cannot be null
pt_br: O campo não pode ser nulo

# NUMBER_GREATER_THAN_ZERO
source: Number must be greater than zero
pt_br: Número deve ser maior que zero

# PASSWORD_LOWERCASE_CHARACTERS
source: Password must contain at least one lowercase letter
pt_br: A senha deve conter pelo menos uma letra minúscula

# PASSWORD_MAX_LENGTH
source: Password must be at most 20 characters long
pt_br: A senha deve ter no máximo 20 caracteres

# PASSWORD_MIN_LENGTH
source: Password must be at least 8 characters long
pt_br: A senha deve ter no mínimo 8 caracteres

# PASSWORD_NUMBER
source: Password must contain at least one number
pt_br: A senha deve conter pelo menos um número

# PASSWORD_SPECIAL_CHARACTER
source: Password must contain at least one special character (!, @, #, etc.)
pt_br: A senha deve conter pelo menos um caractere especial (!, @, #, etc.)

# PASSWORD_UPPERCASE_CHARACTERS
source: The password should contain at least 1 uppercase character.
pt_br: A senha deve conter pelo menos uma letra maiúscula

# QUANTITY_BETWEEN_10 AND_20
source: Purchases of 10 to 20 identical items receive a 20% discount.
pt_br: Compras entre 10 e 20 itens idênticos têm 20% de desconto

# QUANTITY_GREATER_THAN_20
source: You cannot sell more than 20 identical items.
pt_br: Não é possível vender acima de 20 itens idênticos

# QUANTITY_GREATER_THAN_4
source: Purchases of 4 or more identical items have a 10% discount
pt_br: Compras de 4 itens idênticos ou mais têm 10% de desconto

# QUANTITY_GREATER_THAN_ZERO
source: Quantity must be greater than zero
pt_br: A quantidade deve ser maior que zero

# QUANTITY_LESS_THAN_4
source: Purchases of less than 4 items do not have a discount.
pt_br: Compras abaixo de 4 itens não possuem desconto
